"""
Домашнее задание 2 (срок – 07.09.2020, до конца дня)
Задача: реализовать игру в пятнашки

Требования:
- Игра пятнашки: https://ru.wikipedia.org/wiki/%D0%98%D0%B3%D1%80%D0%B0_%D0%B2_15
- Поле состоит из клеток от 1 до 15 и пустой клетки
- Управление ведется кнопками "wasd", двигается пустая клетка
- В начале игры поле перемешено в случайном порядке
- Пользователь не должен совершать непозволительные шаги. Например, из-за ограничений рамки поля. Ему должно
  показываться сообщение о том, что он пытается совершить непозволительный ход
- Пользователю должно быть видно поле. Оно представляет собой матрицу 4 на 4. Пустую клетку обозначаем как x.
  При каждом действии пользователя поле рисуется еще раз - ниже в консоли
- Игра заканчивается, когда все клетки стоят по порядку, а пустая клетка - последняя. В конце игры пользователю
  показывается, сколько ходов он совершил
- Выход из игры происходит при помощи `ctrl + c`

Технические требования:
- Во вложении zip-архив с материалами для выполнения задания, используйте его в качестве основы.
- Игра должна соответствовать интерфейсу из файла game.py. Под "соответствовать интерфейсу" следует понимать: программа
  может иметь только те константы и функции, что уже определены, сам файл должен называться: `game.py`
- Внутри реализуемых функций может происходить любая логика
- Поле должно быть реализовано как плоский список

Дополнительные требования (продвинутый уровень, необязательно):
- Обратите внимание, что не любое поле оставляет возможность закончить игру, необходимо придумать корректный алгоритм
  генерации взамен простого перемешивания
- Можете попробовать запустить тесты, которые приложены для проверки при помощи `pytest`
"""

# TODO: Реализовать решение задачи №2
